{
  "competitions": [
    {
      "id": "spelling-bee",
      "title": "German Spelling Bee",
      "icon": "📝",
      "description": "Test your German spelling skills with increasingly difficult words in this competitive spelling challenge.",
      "categories": "Beginner, Intermediate, Advanced",
      "datetime": "22nd June, 2025 midnight",
      "eligibility": "All current students of participating schools",
      "deadline": "15th June, 2025 midnight",
      "fullDescription": "<p>The German Spelling Bee challenges participants to correctly spell increasingly difficult German words. This competition tests your knowledge of German orthography, including special characters, compound words, and grammatical rules.</p><p>Participants will compete in rounds, with words becoming progressively more challenging. You'll need to spell each word correctly, including proper capitalization and umlauts where applicable.</p><p>This competition is perfect for language enthusiasts who take pride in their attention to detail and precision in written German.</p>",
      "rules": [
        "Each participant will have 30 seconds to spell a word after it is announced.",
        "Contestants may ask for the definition, language of origin, and usage in a sentence.",
        "Once you begin spelling a word, you cannot start over.",
        "Correct capitalization and all special characters (ä, ö, ü, ß) must be included.",
        "Three rounds of increasing difficulty will be conducted."
      ],
      "categoryOptions": [
        { "value": "", "label": "Select a category" },
        { "value": "beginner", "label": "Beginner (1-2 years of study)" },
        { "value": "intermediate", "label": "Intermediate (3-4 years of study)" },
        { "value": "advanced", "label": "Advanced (5+ years of study)" }
      ]
    },
    {
      "id": "cultural-quiz",
      "title": "Cultural Knowledge Quiz",
      "icon": "🧠",
      "description": "Show your knowledge of German history, culture, geography, and current events in this challenging quiz.",
      "categories": "Individual, Team",
      "datetime": "22nd June, 2025 midnight",
      "eligibility": "All current students of participating schools",
      "deadline": "15th June, 2025 midnight",
      "fullDescription": "<p>The Cultural Knowledge Quiz tests your understanding of German-speaking countries' history, geography, politics, art, literature, music, sports, and current events. This comprehensive challenge will separate casual enthusiasts from true German culture aficionados.</p><p>Participants may compete individually or in teams of up to three people. The quiz consists of multiple rounds featuring various question formats including multiple choice, short answer, identification, and lightning rounds.</p><p>This competition rewards both breadth and depth of knowledge about German-speaking countries and their global influence.</p>",
      "rules": [
        "Individual participants compete alone; teams may have up to 3 members.",
        "Electronic devices are not permitted during the competition.",
        "The quiz will cover German history, geography, arts, literature, music, sports, politics, and current events.",
        "Judges' decisions are final on all answers.",
        "In case of a tie, a sudden-death question round will determine the winner."
      ],
      "categoryOptions": [
        { "value": "", "label": "Select a category" },
        { "value": "individual", "label": "Individual Participant" },
        { "value": "team", "label": "Team (2-3 members)" }
      ]
    },
    {
      "id": "film-media",
      "title": "German Film & Media Creation",
      "icon": "🎬",
      "description": "Create original short films or media projects that highlight German culture, language, or history.",
      "categories": "Individual, Group",
      "datetime": "22nd June, 2025 midnight",
      "eligibility": "All current students of participating schools",
      "deadline": "15th June, 2025 midnight",
      "fullDescription": "<p>The German Film & Media Creation Competition invites participants to produce original short films, documentaries, animations, or digital media projects that explore aspects of German language, culture, or history.</p><p>Projects should be 3-8 minutes in length and may incorporate various media elements. While the primary language should be German, limited use of other languages with subtitles is permitted.</p><p>This competition offers creative individuals and teams the opportunity to express their connection to German culture through visual storytelling and digital arts.</p>",
      "rules": [
        "Projects must be 3-8 minutes in length.",
        "Content must relate to German language, culture, or history.",
        "Primary language should be German (limited use of other languages with German subtitles is permitted).",
        "Projects must be original work created for this competition.",
        "All necessary permissions for music, images, or footage must be secured and documented."
      ],
      "categoryOptions": [
        { "value": "", "label": "Select a category" },
        { "value": "individual", "label": "Individual Creator" },
        { "value": "small-group", "label": "Small Group (2-4 people)" },
        { "value": "large-group", "label": "Large Group (5+ people)" }
      ]
    }
  ]
}
