{
  "competitions": [
    {
      "id": "singing",
      "title": "Singing Competition",
      "icon": "<span class='material-icons'>mic</span>",
      "description": "Perform iconic and contemporary German songs with flawless pronunciation, rich emotion, and captivating stage presence.",
      "categories": "Inter School, Inner School",
      "datetime": "June 25, 2025 • 11:59 PM",
      "location": "Online",
      "eligibility": "All students aged 19 and under",
      "deadline": "June 30, 2025 • 11:59 PM",
      "fullDescription": "<p>The German Singing Competition is a vibrant and expressive event held as part of The German Day, where participants bring the language to life through song. Whether it’s a timeless classic or a modern chart-topper, participants are free to perform any German song that speaks to them.</p><p>There are no restrictions on song selection, as long as the lyrics are in German. Performances will be judged on pronunciation, vocal quality, musicality, and emotional delivery.</p><p>Participants are requested to record their performance and upload the video to the designated link shared in the WhatsApp group.</p>",
      "rules": [
        "Participants must perform a song in German.",
        "There is no restriction on song choice, as long as it's in German.",
        "Performance time limit: 4 minutes maximum.",
        "Instrumental backing tracks or a cappella performances are allowed.",
        "Props are not allowed, but expressive gestures and movement are encouraged.",
        "Participants must upload a video recording of their performance to the link shared in the WhatsApp group.",
        "Judging criteria: pronunciation, vocal quality, musicality, and emotional delivery."
      ],
      "categoryOptions": [
        { "value": "", "label": "Select a category" },
        { "value": "Inter School", "label": "Inter School" },
        { "value": "Intra School", "label": "Intra School" }
      ]
    },
    {
      "id": "art",
      "title": "Art Competition",
      "icon": "<span class='material-icons'>image</span>",
      "description": "Create original artwork inspired by German culture, language, or landmarks. Let your creativity speak in colors, shapes, and imagination!",
      "categories": "Inter School, Intra School",
      "datetime": "June 25, 2025 • 11:59 PM",
      "location": "Online",
      "eligibility": "All students aged 19 and under",
      "deadline": "June 30, 2025 • 11:59 PM",
      "fullDescription": "<p>The German Art Competition is a creative celebration of language, culture, and imagination. Participants are invited to create original artwork inspired by German themes — whether that’s iconic landmarks, cultural symbols, famous German quotes, or abstract expressions of the language itself.</p><p>This is a chance to express your understanding of German through visual art, blending creativity with cultural exploration. All skill levels are welcome, and submissions will be judged on creativity, relevance to the theme, originality, and artistic quality.</p><p>Note: The theme will be announced in the WhatsApp group.</p>",
      "rules": [
        "Art must be original and created by the participant.",
        "The theme will be announced in the WhatsApp group.",
        "Accepted formats: drawings and paintings (A4 or A3 size).",
        "Participants must include a short caption or title (in German) explaining their artwork.",
        "Submissions must be scanned or photographed clearly and uploaded via the link shared in the WhatsApp group.",
        "Judging criteria: creativity, cultural relevance, originality, and artistic execution."
      ],
      "categoryOptions": [
        { "value": "", "label": "Select a category" },
        { "value": "Inter School", "label": "Inter School" },
        { "value": "Intra School", "label": "Intra School" }
      ]
    },
    {
      "id": "poetry",
      "title": "Poetry Recitation",
      "icon": "<span class='material-icons'>description</span>",
      "description": "Recite German poetry with flawless pronunciation, clear intonation, and expressive emotional delivery that brings each verse to life.",
      "categories": "Inter School, Intra School",
      "datetime": "June 25, 2025 • 11:59 PM",
      "location": "Online",
      "eligibility": "All students aged 19 and under",
      "deadline": "June 30, 2025 • 11:59 PM",
      "fullDescription": "<p>The German Poetry Recitation Competition is one of the most prestigious events of German Day. Participants will recite poetry from memory, showcasing their mastery of pronunciation, intonation, and artistic interpretation.</p><p>Participants will select poems from our curated collection. Performances will be judged on pronunciation, memorization, artistic interpretation, and stage presence.</p><p>This competition offers a unique opportunity to engage deeply with German literary culture and demonstrate your language proficiency in a creative and expressive way.</p>",
      "rules": [
        "Participants must recite from memory (no reading allowed).",
        "Performance time limit: 3 minutes maximum.",
        "Props are not allowed, but appropriate gestures and movement are encouraged.",
        "Participants must select a poem from the provided collection.",
        "Participants will be judged on pronunciation, memorization, artistic interpretation, and stage presence."
      ],
      "categoryOptions": [
        { "value": "", "label": "Select a category" },
        { "value": "Inter School", "label": "Inter School" },
        { "value": "Intra School", "label": "Intra School" }
      ]
    },
    {
      "id": "ttc",
      "title": "Toungue Twister Challenge",
      "icon": "<span class='material-icons'>psychology</span>",
      "description": "Test your German pronunciation skills with challenging tongue twisters. Show off your fluency and clarity in this fun competition!",
      "categories": "Inter School",
      "datetime": "June 25, 2025 • 11:59 PM",
      "location": "Online",
      "eligibility": "All students aged 19 and under",
      "deadline": "June 30, 2025 • 11:59 PM",
      "fullDescription": "<p>The Tongue Twister Challenge is a fun and engaging competition that tests participants' pronunciation skills in German. Participants will be given a series of challenging tongue twisters to recite, showcasing their fluency, clarity, and ability to articulate complex sounds.</p><p>Participants will be given a list of tongue twisters. Each person must pick one and repeat it continuously for 30 seconds.</p>",
      "rules": [
        "Each participant will be given a list of tongue twisters. Participants may select one tongue twister of their choice from the list.",
        "Participants are kindly requested to repeat their chosen tongue twister continuously for 30 seconds.",
        "Participants are encouraged to speak clearly and maintain a steady pace throughout the 30 seconds. Minor stumbles are acceptable — just do your best to keep going.",
        "Kindly refrain from altering the words, skipping parts, or pausing for too long during the attempt.",
        "Participants must ensure that their video recording is clear and audible.",
        "Participants must record their attempt and upload the video to the link shared in the WhatsApp group.",
        "Judging criteria: clarity, fluency, and overall pronunciation."
      ],
      "categoryOptions": [
        { "value": "", "label": "Select a category" },
        { "value": "Inter School", "label": "Inter School" }
      ]
    },
    {
      "id": "speech",
      "title": "Speech Competition",
      "icon": "<span class='material-icons'>article</span>",
      "description": "Deliver a compelling speech on a topic related to German culture, history, or language. Showcase your eloquence and persuasive skills!",
      "categories": "Inter School, Intra School",
      "datetime": "June 25, 2025 • 11:59 PM",
      "location": "Online",
      "eligibility": "All students aged 19 and under",
      "deadline": "June 30, 2025 • 11:59 PM",
      "fullDescription": "<p>The German Speech Competition is a platform for participants to express their thoughts and ideas on topics related to German culture, history, or language. Participants will prepare and deliver a speech that showcases their eloquence, persuasive skills, and understanding of the topic.</p><p>Participants must select a topic from the provided list shared in the WhatsApp group. Speeches will be judged on pronunciation, clarity, argumentation, and overall delivery.</p><p>This competition encourages participants to engage deeply with the German language and culture while honing their public speaking skills.</p>",
      "rules": [
        "Participants must prepare a speech on a given topic in German.",
        "Speech time limit: 4 minutes maximum.",
        "Participants must present their speech without reading from notes or scripts.",
        "Props are not allowed, but appropriate gestures and movement are encouraged.",
        "Participants must select a topic from the provided list shared in the WhatsApp group.",
        "Participants must upload a video recording of their speech to the link shared in the WhatsApp group.",
        "Judging criteria: pronunciation, clarity, argumentation, and overall delivery."
      ],
      "categoryOptions": [
        { "value": "", "label": "Select a category" },
        { "value": "Inter School", "label": "Inter School" },
        { "value": "Intra School", "label": "Intra School" }
      ]
    }
  ]
}